Datenaufbereitung/app/controllers/devices_controller.rb

  def index
    @devices = Device.all
---
SELECT "devices".* FROM "devices"